app/Controllers/Main.php

SELECT *
FROM `cyklistika_race_year`
WHERE `id_race` = 83
AND `year` = 2023
 LIMIT 1
SELECT `cyklistika_rider`.`first_name`, `cyklistika_rider`.`last_name`
FROM `cyklistika_result`
JOIN `cyklistika_rider` ON `cyklistika_result`.`id_rider` = `cyklistika_rider`.`id`
WHERE `id_stage` = '970'
AND `rank` = 1
 LIMIT 1
---
    public function stranka1()
    {
        $raceYearModel = new RaceYear();
        $raceYear = $raceYearModel->where(['id_race' => 83, 'year' => 2023])->first();



        $stageModel = new Stage();
        $stages = $stageModel->where('id_race_year', $raceYear['id'])->orderBy('number', 'asc')->findAll();

        $resultModel = new Result();
        foreach ($stages as &$stage) {
            $winner = $resultModel
                ->select('cyklistika_rider.first_name, cyklistika_rider.last_name')
                ->join('cyklistika_rider', 'cyklistika_result.id_rider = cyklistika_rider.id')
                ->where(['id_stage' => $stage['id'], 'rank' => 1])
                ->first();

SELECT `cyklistika_rider`.`first_name`, `cyklistika_rider`.`last_name`, `cyklistika_rider`.`country`, `cyklistika_result`.`time`
FROM `cyklistika_result`
JOIN `cyklistika_rider` ON `cyklistika_result`.`id_rider` = `cyklistika_rider`.`id`
WHERE `id_stage` = '970'
AND `type_result` = 'GC'
ORDER BY `rank` ASC
---
    public function etapa($id)
    {
        $stageModel = new Stage();
        $stage = $stageModel->find($id);


        $resultModel = new Result();
        $results = $resultModel
            ->select('cyklistika_rider.first_name, cyklistika_rider.last_name, cyklistika_rider.country, cyklistika_result.time')
            ->join('cyklistika_rider', 'cyklistika_result.id_rider = cyklistika_rider.id')
            ->where(['id_stage' => $id, 'type_result' => 'GC'])
            ->orderBy('rank', 'asc')
            ->findAll();